/**************************************************************************************************************************************************/
/*************************************************************** 한국산업기술대학교 ***************************************************************/
/*************************************************************** 메카트로닉스공학과 ***************************************************************/
/*************************************************************** 메카학술동아리 MCC ***************************************************************/
/*************************************************************** 박재완(2008132021) ***************************************************************/
/**************************************************************************************************************************************************/
/*********************************************************** ATmega128 - Dynamixel(AX12) **********************************************************/
/**************************************************************************************************************************************************/


void IO_set_dxl(void);
void TX0_char(char buffer);


void ID_Set(unsigned char id);															//다이나믹셀 ID설정 (개별로 하나만 연결후 원하는 ID 입력)
void Mode_wheel(unsigned char id);														//wheel mode
void Mode_joint(unsigned char id);														//joint mode
void Send_one(unsigned char id, unsigned char length, unsigned char instruction);		//ATmega128에서 다이나믹셀로 패킷 전송	개별제어
void Turn_one(unsigned char id, float value_angle);
			//해당 ID의 다이나믹셀 회전, 0~300도 회전 가능, 12시방향(150도) (제품 설명서 참조)
void Turn_Speed_one(unsigned char id, unsigned int value_rpm);
			//해당 ID의 다이나믹셀 회전 속도, 최대 114rpm, (제품 설명서 참조)
void Send(void);																		//ATmega128에서 다이나믹셀로 패킷 전송	동시제어
void IO_dxl_Turn_sync_sub(unsigned char id, float value_angle, float value_speed);				//다이나믹셀 동시제어용 서브
			//	(다이나믹셀 ID, 이동시킬 위치 각도,	속도)
void IO_dxl_Turn_sync(float delay);															//다이나믹셀 동시제어
			//	(동시제어 후 딜레이)
void Initial_Position(void);															//다이나믹셀의 ID 1번부터 20번까지 위치 초기화
void Read_Status(unsigned char id, unsigned char menu, unsigned char length_read);		//dxl의 원하는 상태 값 전송을 요청함


